<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $departments = [
            'الباطنة',
            'الباطنة العامة',
            'الباطنه',
            '(الباطنه العامه(كلي الصناعى',
            'الجهاز الهضمى',
            'الجهاز الهضمى والكبد',
            'الجهاز الهضمي',
            'الروماتيزم',
            'الصدر',
            'الصدر المتوسطه',
            'العصبيه',
            'العناية المتوسطة للباطنة',
            'العناية المركزة للقلب',
            'القلب',
            'القلب والاوغية الدموية',
            'الكلي الصناعي',
            'المناظير',
            'النفسية والعصبية',
            'النفسيه والعصبيه',
            'الهضمى',
            'اورام',
            'باطنة عامة',
            'باطنه',
            'باطنه عامه',
            '(باطنه عامه (كلي صناعي',
            'جراحه مسالك بوليه',
            'جلديه وتناسليه',
            'جلديه وتناسليه وامراض ذكوره',
            '(جهاز هضمى(منظار',
            'جهاز هضمي',
            'روماتيزم',
            '(روماتيزم (صدر',
            'روماتيزم واعاده التاهيل',
            'صدر',
            'طوارئ كلي صناعي',
            'عصبية و نفسية',
            'عصبيه',
            'عظام',
            'علاج الاورام',
            'عنابه القلب المتوسطه',
            'عنايات الباطنة العامة',
            'عناية الباطنة',
            '(عناية الباطنة (طوارئ'
        ];

        foreach ($departments as $department) {
            DB::table('departments')->insert([
                'name' => $department,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}
